Repository: Fontan030/uv-vis-dsp-viewer
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: kk, ru

source: UV range
kk: Ультракүлгін аймақ
ru: УФ-область

source: Visible range
kk: Көрінетін аймақ
ru: Видимая область

source: Enter molar concentration!
kk: Молярлық концентрацияны енгізіңіз!
ru: Введите молярную концентрацию!

source: Restart application to switch language
kk: Тілді өзгерту үшін қолданбаны қайта қосыңыз
ru: Для смены языка требуется перезапуск программы

source: Settings
kk: Баптау
ru: Настройки

source: UV-vis border
kk: УК және көрінетін аймақ арасындағы шекара
ru: Граница между УФ и видимой обл.

source: Default sample concentrations:
kk: Заттардың әдепкі концентрациялары:
ru: Концентрации веществ по умолчанию:

source: mol/L
kk: моль/л
ru: моль/л

source: Reset
kk: Арылту
ru: Сбросить

source: About
kk: Қолданба туралы
ru: О программе

source: A viewer for DSP spectral data files recorded by VISIONlite Scan
kk: VISIONlite Scan шығарған .DSP спектр файлдарын көру құралы
ru: Программа для просмотра электронных спектров в формате DSP (VISIONlite Scan)

source: Powered by matplotlib and tkinter
kk: matplotlib пен tkinter көмегімен жасалған
ru: Создано на основе matplotlib и tkinter

source: nm
kk: нм
ru: нм

source: step
kk: қадамы
ru: шаг

source: Open
kk: Ашу
ru: Открыть

source: Save plot as
kk: Суретті қалайша сақтау
ru: Сохранить график как

source: Language
kk: Тіл
ru: Язык

source: File
kk: Файл
ru: Файл

source: Edit
kk: Өңдеу
ru: Правка

source: Help
kk: Көмек
ru: Помощь

source: Select a .dsp file
kk: .dsp файлын таңдаңыз
ru: Выберите файл .dsp

source: Find peaks
kk: Шыңдарды табу
ru: Найти пики

source: Remove peak
kk: Шыңды өшіру
ru: Убрать пик

source: Molar concentration:
kk: Молярлық концентрация:
ru: Молярная концентрация:

source: Calculate extinction
kk: Экстинкция есептеу
ru: Вычислить экстинкцию

source: Update plot
kk: Графикті жаңарту
ru: Обновить график

source: Copy
kk: Көшіру
ru: Копировать
